@maxlaverse Thanks for the feedback. On the Bitwarden premium - let me know if you don't make progress with getting an account. This provider is useful enough to me I'd be glad to help sponsor getting you one.

Also - I created an example showing how another terraform module handles the unknown-before-apply with file upload:
https://github.com/ebob9/bw_ssh_key_test/tree/aws_works

In that modification of the example code above, I replaced bitwarden module with AWS S3, and performed a similar function - upload a new file to an AWS s3 bucket. The *conceptual* logic is the same - request to upload a file by path that "does not yet exist"/Unknown until apply.

In that module, you can see in the logs below that the provider understands that the file does not yet exist, and waits for it to be created. I wonder if you can [look into how they are doing it](https://github.com/hashicorp/terraform-provider-aws/tree/v5.97.0/internal/service/s3) and see if their implementation would be helpful to solve this issue?

Here's the logs from a successful apply of the S3 upload-before-create:

```
(.venv) ebob9-mbp:test ebob9$ tofu apply

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_s3_object.object will be created
  + resource "aws_s3_object" "object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "bitwarden-tf-upload-test"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "bw_ssh_key_test.pem"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./bw_ssh_key_test.pem"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_sensitive_file.pem_file will be created
  + resource "local_sensitive_file" "pem_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "700"
      + file_permission      = "600"
      + filename             = "./bw_ssh_key_test.pem"
      + id                   = (known after apply)
    }

  # random_password.random_password will be created
  + resource "random_password" "random_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 1
      + min_numeric      = 1
      + min_special      = 1
      + min_upper        = 1
      + number           = true
      + numeric          = true
      + override_special = "!#$%&"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.random_user will be created
  + resource "random_password" "random_user" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 10
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # tls_private_key.rsa_key will be created
  + resource "tls_private_key" "rsa_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tls_private_key.rsa_key: Creating...
random_password.random_password: Creating...
random_password.random_user: Creating...
random_password.random_password: Creation complete after 0s [id=none]
random_password.random_user: Creation complete after 0s [id=none]
tls_private_key.rsa_key: Creation complete after 1s [id=a27ffaac8931ed465732cfe5efe98aca4320407f]
local_sensitive_file.pem_file: Creating...
local_sensitive_file.pem_file: Creation complete after 0s [id=0e75043bde7e246dd1a7781c12ca80265017a8ff]
aws_s3_object.object: Creating...
aws_s3_object.object: Creation complete after 0s [id=bw_ssh_key_test.pem]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.
(.venv) ebob9-mbp:test ebob9$ 

```

